#! /бин/цсх
# kОМАНДНЫЙ ФАЙЛ ДЛЯ НАЧАЛЬНОЙ НАСТРОЙКИ СИСТЕМЫ
# ~АСТЬ 2 - НАСТРОЙКА ДИСКОВ.
уналиас *
сет патх=(/етц $патх)
сет PROFILE=/.профиле
сет RC=/етц/рц
сет TTYS=/етц/ттыс
сет ROOT=/
сет TUSR=7
сет TSYS=8
сет TUSR1=9
сет STTY=()
ецхо "\
           ***  ****** *     *  ****   ****           ****  \
          *  *  *      **   ** *    * *    *         *    * \
         *   *  *      * * * * *    * *                   * \
         *   *  ****   *  *  * *    * *                  *  \
         *   *  *      *     * *    * *                *    \
        ******* *      *     * *    * *    *          *     \
        *     * ****** *     *  ****   ****          ****** \
"
#
алиас едиаг 'ецхо \!:1'
иф ( $?MSG != 0 ) тхен
иф ( $MSG == р ) алиас едиаг 'ецхо \!:2'
ендиф
асктдиск:
    едиаг "Eнтер ыоу сыстем диск тыпе" "wВЕДИТЕ ОБОЗНАЧЕНИЕ ТИПА СИСТЕМНЫХ ДИСКОВ"
    едиаг "рк - фор SM 5400" "рк - ДЛЯ sm-5400"
    едиаг "хк - фор SM 5408" "хк - ДЛЯ sm-5408"
    едиаг "рп - фор SM 5407" "рп - ДЛЯ sm-5407"
    едиаг "ьп - фор SM 5404" "ьп - ДЛЯ sm-5404"
    ецхо -н "(рк рп хк ьп) ?"
    сет тдиск=$<
    свитцх ($тдиск)
        цасе рк:
        едиаг "Eнтер тхе нумбер оф тхе сыстем диск" "wВЕДИТЕ НОМЕР СИСТЕМНОГО ДИСКА"
        ецхо -н "(0 1 2 3)?"
        сет нум=$<
        иф ( $нум !ч [0123] ) тхен
        едиаг "Eррор" "wЫ ОШИБЛИСЬ"
        гото асктдиск
        ендиф
        сет роотдеж = рк$нум
        сет свапдеж = рк$нум
        сет цонф=рк$нум
        иф ( $нум == 0 ) сет цонф=рк
        бреаксв
        цасе хк:
        едиаг "Sыстем ассумед он диск 0" "sИСТЕМА ДОЛЖНА НАХОДИТЬСЯ НА МОДУЛЕ 0"
        сет роотдеж=хк0а
        сет свапдеж=хк0б
        сет усрдеж=хк0д
        сет цонф=хк
        бреаксв
        цасе ьп:
        едиаг "Sыстем ассумед он диск 0" "sИСТЕМА ДОЛЖНА НАХОДИТЬСЯ НА МОДУЛЕ 0"
        сет роотдеж=ьп0а
        сет свапдеж=ьп0б
        сет усрдеж=ьп0ц
        сет цонф=ьп
        бреаксв
        цасе рп:
        едиаг "Sыстем ассумед он диск 0" "sИСТЕМА ДОЛЖНА НАХОДИТЬСЯ НА МОДУЛЕ 0"
        сет роотдеж=рп0а
        сет свапдеж=рп0б
        сет усрдеж=рп0ц
        сет цонф=рп
        бреаксв
        дефаулт:
        едиаг "Uнкновн тыпе $тдиск" "nЕИЗВЕСТНЫЙ ТИП $тдиск"
        едиаг "Rепеат" "pОВТОРИТЕ"
        гото асктдиск
    ендсв
    ецхо "роот=$роотдеж свап=$свапдеж"
    едиаг "Eнтер 1, иф нот" "wВЕДИТЕ 1, ЕСЛИ НЕ ТАК"
    ецхо -н "(0 1)?"
    сет анс=$<
    иф ( "$анс" == "1" ) гото асктдиск
#
#
едиаг "Eнтер 0, иф ыоу вант то сет уп сыстем филес фор тхе тыпе оф сыстем диск" ""
едиаг "" "wВЕДИТЕ 0, ЕСЛИ НУЖНО НАСТРОИТЬ СИСТЕМНЫЕ ФАЙЛЫ НА ТИП СИСТЕМНЫХ ДИСКОВ"
едиаг "Eлсе ентер 1" "iНАЧЕ ВВЕДИТЕ 1"
ецхо -н "(0 1) ?"
сет анс=$<
иф ( "$анс" == 1 ) гото реадсыс
    сет ецхо
    цд $ROOT
    цп мдец/$штдискщубоот /деж/$роотдеж
    сынц
    цп цонф/$цонф цонфа
    цп етц/фстаб.$тдиск етц/фстаб
    рм -ф деж/свап
    лн деж/$свапдеж деж/свап
    сынц
    унсет ецхо
    едиаг "Dиск сет уп реады" "sИСТЕМА НА ТИП ДИСКОВ НАСТРОЕНА"
#
#
реадсыс:
едиаг "Eнтер 0, иф ыоу вант то реад филес фром тапе" ""
едиаг "" "wВЕДИТЕ 0, ЕСЛИ ВЫ БУДЕТЕ СЧИТЫВАТЬ ФАЙЛЫ С ЛЕНТЫ"
едиаг "Eлсе ентер 1" "iНАЧЕ ВВЕДИТЕ 1"
ецхо -н "(0 1) ?"
сет анс=$<
иф ( "$анс" == 1 ) еьит 0
иф ( $тдиск == рк ) тхен
 едиаг "Tхере неед вхоле диск фор: " "nУЖНО ПО ЦЕЛОМУ ДИСКУ ДЛЯ"
 ецхо "уср , сыс, ман"
 едиаг "Iф ыоу хаже форматтед пацкетс он дежице, ентер 0, елсе ентер 1" ""
 едиаг "" "wВЕДИТЕ 0, ЕСЛИ У ВАС ГОТОВ СФОРМАТИРОВАННЫЙ ПАКЕТ (ПАКЕТЫ), ИНАЧЕ 1"
 ецхо -н "(0 1) ?"
 сет анс=$<
 иф ( "$анс" == 1 ) тхен
     едиаг "Hалт тхе сыстем (ребоот -х), тхен формат усинг роллин, тхен боот анд репеат" ""
     едиаг "" "oСТАНОВИТЕ СИСТЕМУ (ребоот -х), ЗАТЕМ СФОРМАТИРУЙТЕ ПАКЕТЫ С "
     едиаг "" "ПОМОЩЬЮ роллин, ЗАТЕМ ВЫЗОВИТЕ СИСТЕМУ И ПОВТОРИТЕ старт"
     едиаг "Tо цалл роллин, усе 'боот' цомманд: рк(0,0)мдец/роллин" ""
     едиаг "" "роллин МОЖНО ВЫЗВАТЬ С СИСТЕМНОГО ДИСКА С ПОМОЩЬЮ боот: рк(0,0)мдец/роллин"
     еьит 0
 ендиф
ендиф
ртапен:
        едиаг "Sет уп тапе анд ентер дежице нумбер" "uСТАНОВИТЕ ЛЕНТУ И ВВЕДИТЕ НОМЕР УСТРОЙСТВА"
        ецхо -н "(0 1 2 3)?"
        сет нум=$<
        иф ( $нум !ч [0-3] ) тхен
        едиаг "Eррор" "wЫ ОШИБЛИСЬ"
        гото ртапен
        ендиф
        сет тдеж=/деж/нрмт$нум
        сетенж TAPE $тдеж
#
#
# rАЗМЕТКА уср
невуср:
иф ( $тдиск == рк ) тхен
едиаг "Sет уп нев диск фор уср анд ентер дежице нумбер" "uСТАНОВИТЕ ПАКЕТ ПОД уср И ВВЕДИТЕ НОМЕР УСТРОЙСТВА"
ецхо -н "(0 1 2 3 4 5 6 7)?"
        сет нум=$<
        иф ( $нум !ч [0-7] ээ рк$нум == $роотдеж ) тхен
        едиаг "Eррор" "wЫ ОШИБЛИСЬ"
        гото невуср
        ендиф
        сет усрдеж=рк$нум
ендиф
едиаг "Eнтер 0 то маке нев филе сыстем он $усрдеж" "wВЕДИТЕ 0, ЧТОБЫ СОЗДАТЬ НА $усрдеж НОВУЮ ФАЙЛОВУЮ СИСТЕМУ"
едиаг "Eнтер 1 то финд бад блоцкс анд маке нев филе сыстем он $усрдеж" "wВЕДИТЕ 1, ЧТОБЫ НАЙТИ ПЛОХИЕ БЛОКИ И СОЗДАТЬ НА $усрдеж НОВУЮ ФАЙЛОВУЮ СИСТЕМУ"
едиаг "елсе ентер 2 (иф ит еьист)" "ИЛИ 2, ЕСЛИ ОНА УЖЕ СОЗДАНА"
ецхо -н "(0 1 2)?"
сет ецхо
сет анс=$<
иф ( "$анс" != 2 ) тхен
 сет кеыс=""
 иф ( "$анс" == 1 ) сет кеыс=-ц
 сет ецхо
 невфс $кеыс $усрдеж ээ гото  бадцмд
ендиф
реадуср:
моунт -т /тмп/а -п /деж/$усрдеж /уср
моунт э греп -с "/уср"
иф ( $статус != 0 ) тхен
едиаг "/уср нот моунт дуе то еррорс, репеат алл" "/уср НЕ СМОНТИРОВАН ИЗ ЗА ОШИБОК, ПОВТОРИТЕ ВСЕ"
еьит 1
ендиф
сет ецхо
мт рев фсф $TUSR
цд /уср
иф ( $тдиск == рк ) тхен
едиаг "Rеад уср онлы" "~ИТАЕМ ТОЛЬКО уср"
тар ьжпи
едиаг "Oтхер филе сыстем маке анд реад ыоуселф (сыс, ман анд доц фром тапе2)"
еьит 0
елсе
едиаг "Rеад алл фром тхис тапе " "~ИТАЕМ ВСЕ, ЧТО ЕСТЬ НА ЛЕНТЕ"
тар ьжпиа
ендиф
ецхо Rеады
#
# kОНЕЦ
еьит 0
бадцмд:
едиаг "Eррор. Cан нот маке. Rепеат." "oШИБКА, НЕ МОГУ ВЫПОЛНИТЬ. pОВТОРИТЕ."
еьит 1
 